app/views/companies/index.html.erb

SELECT "companyevents".* FROM "companyevents" WHERE "companyevents"."company_id" = $1 AND "companyevents"."company_id" = $2 AND "companyevents"."event_id" = $3  [["company_id", 1], ["company_id", 1], ["event_id", 1]]
---
        <% @events.each do |e| %>
            <% rep = company.companyevents.where(company_id: company.id, event_id: e.id).to_yaml.match(/representatives: [ \t]*([^\n\r]*)/).to_s.match(/'(.*)'/).to_s.gsub("'","") %>