app/controllers/appointments_controller.rb

  def index
    # Sort appointments by section, then by timeslot
    @appointments = Appointment.all.order(:section, :time_slot)
---
SELECT "appointments".* FROM "appointments"  ORDER BY "appointments"."section" ASC, "appointments"."time_slot" ASC

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("section", "time_slot", "company", "student", "UIN", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    # Standard Rails behavior. Delete appointment with given id.
    @appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 12]]

  def generate
    @studentfinish = []
    @errormessage = ["Error timeslot Below:"]
    Appointment.delete_all

    events = Event.all
---
DELETE FROM "appointments"
SELECT "events".* FROM "events"