app/controllers/companies_controller.rb

  def index
    @companies = Company.all.order(:name)
    @events = Event.where("for_company = true")
---
SELECT "companies".* FROM "companies"  ORDER BY "companies"."name" ASC
SELECT "events".* FROM "events" WHERE (for_company = true)

  def show
    @reps = @company.companyevents.collect(&:representatives)
---
SELECT "companyevents".* FROM "companyevents" WHERE "companyevents"."company_id" = $1  [["company_id", 2]]

  def new
    @company = Company.new
    @company.companyevents.build

    @eves = Event.where("for_company = true").pluck(:id, :name, :event_date, :start_time, :end_time, :careerfair)
---
SELECT "events"."id", "events"."name", "events"."event_date", "events"."start_time", "events"."end_time" FROM "events" WHERE (for_company = true)

  def edit
    @eves = Event.where("for_company = true").pluck(:id, :name, :event_date, :start_time, :end_time, :careerfair)
    @it = 0
    @new_flag = 0
    eve_ids = Event.where("for_company = true").pluck(:id)
    company_events = @company.companyevents.collect(&:event_id)
---
SELECT "events"."id", "events"."name", "events"."event_date", "events"."start_time", "events"."end_time" FROM "events" WHERE (for_company = true)
SELECT "companyevents".* FROM "companyevents" WHERE "companyevents"."company_id" = $1  [["company_id", 3]]

  def create
    @company = Company.new(company_params)
    eve_id = Event.where("for_company = true").pluck(:id)

    respond_to do |format|
      if @company.save
        input_session(@company.id)
        i = 0
        @company.companyevents.where(company_id: @company.id).each do |ce|
          ce.update(event_id: eve_id[i])
          i = i + 1
        end

        # This was one use of the previous broken mailer. Replace this with the new mailer, and remove this comment.
        # UserMailer.com_reg(@company).deliver_now

        format.html { redirect_to @company, notice: 'Company was successfully created.' }
        format.json { render :show, status: :created, location: @company }
      else
        @eves = Event.where("for_company = true").pluck(:id, :name, :event_date, :start_time, :end_time, :careerfair)
---
SELECT "events"."id" FROM "events" WHERE (for_company = true)
INSERT INTO "companies" ("name", "contact_person", "contact_email", "sponsor_level", "citizenship", "job_type", "rep_1", "rep_2", "rep_3", "rep_4", "rep_5", "rep_6", "student_level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
SELECT "companyevents".* FROM "companyevents" WHERE "companyevents"."company_id" = $1 AND "companyevents"."company_id" = $2 AND "companyevents"."event_id" = $3  [["company_id", 1], ["company_id", 1], ["event_id", 1]]
SELECT "events"."id", "events"."name", "events"."event_date", "events"."start_time", "events"."end_time" FROM "events" WHERE (for_company = true)

  def update
    respond_to do |format|
      if @company.update(company_params)
        eve_id = Event.where("for_company = true").pluck(:id)
        it = 0
        @company.companyevents.where(company_id: @company.id).each do |ce|
          ce.update(event_id: eve_id[it])
          it = it + 1
        end

        # This was one use of the previous broken mailer. Replace this with the new mailer, and remove this comment.
        # UserMailer.com_reg(@company).deliver_now

        format.html { redirect_to @company, notice: 'Company was successfully updated.' }
        format.json { render :show, status: :ok, location: @company }
      else
        @eves = Event.where("for_company = true").pluck(:id, :name, :event_date, :start_time, :end_time, :careerfair)
        @it = 0
        @new_flag = 0
        @reps = @company.companyevents.collect(&:representatives)
---
UPDATE "companies" SET "citizenship" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["citizenship", "true"], ["updated_at", "2016-10-20 21:21:20.011470"], ["id", 7]]
SELECT "events"."id" FROM "events" WHERE (for_company = true)
SELECT "companyevents".* FROM "companyevents" WHERE "companyevents"."company_id" = $1 AND "companyevents"."company_id" = $2  [["company_id", 7], ["company_id", 7]]
SELECT "events"."id", "events"."name", "events"."event_date", "events"."start_time", "events"."end_time" FROM "events" WHERE (for_company = true)
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 7]]

  def destroy
    @company.companyevents.destroy_all
---
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 12]]

    def set_company
      @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 12]]