app/controllers/events_controller.rb

  def index
    @events = Event.all.order(:event_date, :name)
---
SELECT "events".* FROM "events"  ORDER BY "events"."event_date" ASC, "events"."name" ASC

  def show
    @events = Event.where(id: @event.id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]

  def create
    @event = Event.new(event_params)
    date1 = @event.event_date
    @event.start_time = @event.start_time.change(day:date1.day, year:date1.year, month:date1.month)
    @event.end_time = @event.end_time.change(day:date1.day, year:date1.year, month:date1.month)
	## may include column of event location for the purpose of managing/sending emails
	## lunch time between time slots?

    respond_to do |format|
      if @event.save
        timeslot_start_time = @event.start_time
        timeslot_end_time = timeslot_start_time.advance(minutes: @event.timeslot_duration)
        while(timeslot_end_time <= @event.end_time)
          @timeslot = @event.timeslots.create(:start_time => timeslot_start_time, :end_time => timeslot_end_time, :stunum => @event.max_students)
---
INSERT INTO "events" ("name", "event_date", "start_time", "end_time", "max_students", "timeslot_duration") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Mock_1"], ["event_date", "2015-09-09"], ["start_time", "2015-09-09 10:00:00.000000"], ["end_time", "2015-09-09 12:00:00.000000"], ["max_students", 28], ["timeslot_duration", 20]]
INSERT INTO "timeslots" ("start_time", "end_time", "stunum", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"