app/controllers/sessions_controller.rb

  def create
    useradd = Useradd.find_by(email: params[:session][:email].downcase)
---
SELECT  "useradds".* FROM "useradds" WHERE "useradds"."email" = $1 LIMIT 1  [["email", "bain607@tamu.edu"]]