app/controllers/students_controller.rb

  def index
    @events = Event.where("for_student = true").pluck(:id,:name)
    $students = Student.all.order(:UIN)
    $students.each do |x|
      @arr = Hash.new([])
      # evaluate timeslots
      @tslots = x.timeslots
      @events.each do |ev|
        @check = FALSE
        @tslots.each do |t|
---
SELECT "events"."id", "events"."name" FROM "events" WHERE (for_student = true)
SELECT "students".* FROM "students"  ORDER BY "students"."UIN" ASC
SELECT "timeslots".* FROM "timeslots" INNER JOIN "students_timeslots" ON "timeslots"."id" = "students_timeslots"."timeslot_id" WHERE "students_timeslots"."student_id" = $1  [["student_id", 1]]

  def show
    # Verify login
    unless log_in? || cus_indentify(get_id)
      flash[:danger] = "Please Log in!"
      redirect_to new_session_path
    end

    @events = Event.where("for_student = true").pluck(:id,:name)
    $students = Student.all.order(:UIN)
---
SELECT "events"."id", "events"."name" FROM "events" WHERE (for_student = true)
SELECT "students".* FROM "students"  ORDER BY "students"."UIN" ASC

  def new
    @event_details = Event.where("for_student = true").pluck(:id, :name, :event_date, :start_time, :end_time, :editable)
---
SELECT "events"."id", "events"."name", "events"."event_date", "events"."start_time", "events"."end_time" FROM "events" WHERE (for_student = true)

  def edit
    correct_hash = correct_hash(@student.edithash, params[:edithash])
    # Verify login
    if log_in? || cus_indentify(get_id) || correct_hash
      @event_details = Event.where("for_student = true").pluck(:id, :name, :event_date, :start_time, :end_time, :editable)
      @events = Event.where("for_student = true").pluck(:id, :name)
      # Show Timeslots
      $selected_slots = []
      @student.timeslots.each do |x|
---
SELECT "events"."id", "events"."name", "events"."event_date", "events"."start_time", "events"."end_time" FROM "events" WHERE (for_student = true)
SELECT "timeslots".* FROM "timeslots" INNER JOIN "students_timeslots" ON "timeslots"."id" = "students_timeslots"."timeslot_id" WHERE "students_timeslots"."student_id" = $1  [["student_id", 1]]

  def create
    @student = Student.new(student_params)
    @event_details = Event.where("for_student = true").pluck(:id, :name, :event_date, :start_time, :end_time, :editable)

    # Set edithash
    if @student.edithash == nil
      @student.edithash = SecureRandom.urlsafe_base64
    end

    @events = Event.where("for_student = true").pluck(:id, :name)
    @events.each do |id,name|
      $selected_slots[id] = params[name]
    end

    @event_slots = Hash.new([])
    respond_to do |format|
      # Try to save new information
      if @student.save
        input_session(@student.id)
	      Timeslot.decrease_1(@student.id)

      	@events = Event.where("for_student = true").pluck(:id,:name)
      	@events.each do |id,name|
          temp1, temp2 = set_menu(id)
      	  if(params[name] != "0"  && !params[name].nil? && !params[name].empty?)
      	    @student.timeslots << Timeslot.find(params[name])
---
SELECT "events"."id", "events"."name", "events"."event_date", "events"."start_time", "events"."end_time" FROM "events" WHERE (for_student = true)
INSERT INTO "students" ("name", "UIN", "email", "US_Citizen", "degree", "position_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "timeslots".* FROM "timeslots" INNER JOIN "students_timeslots" ON "timeslots"."id" = "students_timeslots"."timeslot_id" WHERE "students_timeslots"."student_id" = $1  [["student_id", 3]]


        # Show all students
        @events = Event.where("for_student = true").pluck(:id,:name)
        $students = Student.all.order(:UIN)
---
SELECT "students".* FROM "students"  ORDER BY "students"."UIN" ASC

  def update
    respond_to do |format|
      @event_details = Event.where("for_student = true").pluck(:id, :name, :event_date, :start_time, :end_time, :editable)
      @events = Event.where("for_student = true").pluck(:id, :name)
      @events.each do |id,name|
        $selected_slots[id] = params[name]
      end

      # When updating, temporarily release timeslots
    	Timeslot.increase_1(@student.id)
    	@student.timeslots = []
    	@events = Event.where("for_student = true").pluck(:name)
    	@events.each do |name|
      	if(params[name] != "0"  && !params[name].nil? && !params[name].empty?)
      	    @student.timeslots << Timeslot.find(params[name])
---
SELECT "events"."id", "events"."name", "events"."event_date", "events"."start_time", "events"."end_time" FROM "events" WHERE (for_student = true)
SELECT "timeslots".* FROM "timeslots" INNER JOIN "students_timeslots" ON "timeslots"."id" = "students_timeslots"."timeslot_id" WHERE "students_timeslots"."student_id" = $1  [["student_id", 6]]

    def set_menu(arg)
      result_slots= Timeslot.where("event_id = ? AND stunum > 0", arg).collect{|item| [item.id, item.start_time, item.end_time, item.stunum]}
---
SELECT "timeslots".* FROM "timeslots" WHERE (event_id = 1 AND stunum > 0)